<template>
  <div data-v-31450254="" class="cooperation">
    <div data-v-31450254="" class="container"><h3 data-v-31450254="">Пользовательское соглашение и сотрудничество</h3>
      <div data-v-31450254="" class="wrapper">
        <div data-v-31450254="" class="tabs">
          <div data-v-31450254="" class="tab" :class="[tab === 'agreement' ? 'active' : '']" @click="tab = 'agreement'">
            <svg data-v-31450254="" width="22" height="22" viewBox="0 0 22 22" fill="none"
                 xmlns="http://www.w3.org/2000/svg">
              <path data-v-31450254=""
                    d="M11.0001 12.3916C4.38995 12.3916 0.749512 15.5187 0.749512 21.197C0.749512 21.6405 1.10895 21.9999 1.55243 21.9999H20.4478C20.8913 21.9999 21.2507 21.6405 21.2507 21.197C21.2508 15.519 17.6103 12.3916 11.0001 12.3916ZM2.38456 20.3941C2.70038 16.1485 5.59488 13.9975 11.0001 13.9975C16.4054 13.9975 19.2999 16.1485 19.616 20.3941H2.38456Z"
                    fill="#636278"></path>
              <path data-v-31450254=""
                    d="M10.9999 0C7.96346 0 5.67383 2.3357 5.67383 5.43284C5.67383 8.62069 8.06306 11.2139 10.9999 11.2139C13.9366 11.2139 16.3259 8.62069 16.3259 5.4331C16.3259 2.3357 14.0362 0 10.9999 0ZM10.9999 9.60828C8.94839 9.60828 7.27966 7.73532 7.27966 5.4331C7.27966 3.21544 8.84428 1.60583 10.9999 1.60583C13.1209 1.60583 14.72 3.25102 14.72 5.4331C14.72 7.73532 13.0513 9.60828 10.9999 9.60828Z"
                    fill="#636278"></path>
            </svg>
            <span data-v-31450254="">Пользовательское соглашение</span>
            <div data-v-31450254="" class="arrow">
              <svg data-v-31450254="" width="9" height="16" viewBox="0 0 9 16" fill="none"
                   xmlns="http://www.w3.org/2000/svg">
                <path data-v-31450254=""
                      d="M1.99981 14.9999C1.76615 15.0004 1.53972 14.919 1.35981 14.7699C1.25855 14.686 1.17485 14.5829 1.11349 14.4665C1.05214 14.3502 1.01435 14.2229 1.00227 14.0919C0.990194 13.9609 1.00408 13.8289 1.04312 13.7033C1.08217 13.5777 1.1456 13.461 1.22981 13.3599L5.70981 7.99994L1.38981 2.62994C1.30674 2.52765 1.24471 2.40996 1.20728 2.28362C1.16985 2.15728 1.15775 2.02479 1.17169 1.89376C1.18563 1.76273 1.22533 1.63575 1.2885 1.52011C1.35168 1.40447 1.43708 1.30246 1.53981 1.21994C1.64327 1.1289 1.76444 1.06024 1.8957 1.01825C2.02696 0.976258 2.16549 0.961855 2.30258 0.97594C2.43967 0.990024 2.57238 1.03229 2.69236 1.1001C2.81234 1.1679 2.91701 1.25977 2.99981 1.36994L7.82981 7.36994C7.97689 7.54887 8.05729 7.77332 8.05729 8.00494C8.05729 8.23657 7.97689 8.46101 7.82981 8.63994L2.82981 14.6399C2.72949 14.761 2.60206 14.8566 2.45785 14.9192C2.31364 14.9817 2.15671 15.0094 1.99981 14.9999Z"
                      fill="white"></path>
              </svg>
            </div>
          </div>
          <div data-v-31450254="" class="tab" :class="[tab === 'cooperation' ? 'active' : '']" @click="tab = 'cooperation'">
            <svg data-v-31450254="" width="24" height="24" viewBox="0 0 24 24" fill="none"
                 xmlns="http://www.w3.org/2000/svg">
              <g data-v-31450254="" clip-path="url(#clip0)">
                <path data-v-31450254=""
                      d="M21.2248 10.9747C21.4102 10.9747 21.5958 10.9039 21.7372 10.7624L23.7873 8.71233C24.0701 8.42958 24.0704 7.97035 23.7873 7.68732L16.6122 0.51216C16.3292 0.229082 15.8703 0.229082 15.5872 0.51216L13.5371 2.56224C13.2543 2.84499 13.254 3.30422 13.5371 3.58725L13.7329 3.783L12.4196 4.22072C12.2894 4.26413 12.1616 4.31522 12.0371 4.37325L10.2662 3.78296L10.462 3.58721C10.7448 3.30436 10.745 2.84522 10.462 2.56219L8.41199 0.512113C8.12896 0.229035 7.67005 0.229035 7.38698 0.512113L0.21182 7.68732C-0.0712578 7.97039 -0.0712578 8.42925 0.21182 8.71233L2.26185 10.7624C2.5447 11.0453 3.00384 11.0454 3.28687 10.7624L3.48266 10.5667L3.99515 12.1042L3.28691 12.8124C2.43909 13.6603 2.43909 15.0397 3.28691 15.8875C3.68015 16.2808 4.18766 16.4912 4.70352 16.5197C4.7324 17.0555 4.95459 17.5553 5.33695 17.9376C5.73013 18.3308 6.23774 18.5413 6.75355 18.5697C6.78243 19.1056 7.00462 19.6053 7.38698 19.9876C7.78045 20.3811 8.28852 20.5917 8.8048 20.6199C8.83302 21.1361 9.04359 21.6442 9.43705 22.0377C10.115 22.7156 11.1151 22.8446 11.9124 22.463L12.5121 23.0627C13.3619 23.9125 14.7374 23.9126 15.5872 23.0627C15.9695 22.6804 16.1919 22.1809 16.2208 21.6452C16.7366 21.6167 17.2441 21.4058 17.6372 21.0127C18.0306 20.6192 18.2415 20.1113 18.2698 19.5952C18.7859 19.5669 19.2939 19.3561 19.6873 18.9626C20.0805 18.5694 20.2913 18.062 20.3198 17.5462C20.8556 17.5173 21.3551 17.2949 21.7373 16.9126C22.5871 16.0628 22.5873 14.6873 21.7373 13.8375L20.9247 13.0248V10.9089C21.0198 10.9522 21.1221 10.9747 21.2248 10.9747ZM12.8781 5.59594L14.8788 4.92896C15.0112 5.06143 19.3882 9.43843 19.4749 9.52505V11.5751L14.5621 6.6623C14.2791 6.37922 13.8202 6.37922 13.5371 6.6623L11.4871 8.71233C11.2038 8.99564 10.7454 8.99564 10.4621 8.71233C10.1788 8.42907 10.1788 7.97063 10.4621 7.68732L12.0282 6.12122C12.2656 5.88375 12.5595 5.70216 12.8781 5.59594ZM2.77438 9.22486L1.74937 8.1998L7.89946 2.04966L8.92448 3.07468C8.4292 3.57 3.0096 8.98965 2.77438 9.22486ZM4.31198 14.8624C4.02937 14.5799 4.02937 14.12 4.31193 13.8374L5.33695 12.8124C5.61951 12.5298 6.0794 12.5298 6.36201 12.8124C6.64457 13.095 6.64457 13.5548 6.36201 13.8374L5.33699 14.8624C5.05434 15.1451 4.59454 15.145 4.31198 14.8624ZM6.36191 16.9125C6.0786 16.6291 6.07865 16.1708 6.36191 15.8875L7.38693 14.8625C7.66949 14.5799 8.12938 14.5799 8.41195 14.8625C8.69526 15.1458 8.69526 15.6042 8.41195 15.8875L7.38693 16.9125C7.10432 17.1951 6.64452 17.1951 6.36191 16.9125ZM8.41195 18.9625C8.12868 18.6792 8.12868 18.2208 8.41199 17.9375L9.43701 16.9125C9.71962 16.6299 10.1795 16.6299 10.462 16.9125C10.7446 17.1951 10.7446 17.655 10.462 17.9375L9.43701 18.9625C9.1544 19.2451 8.6946 19.2451 8.41195 18.9625ZM12.5121 19.9876L11.4872 21.0125C11.4872 21.0125 11.4871 21.0126 11.4871 21.0126L11.487 21.0126C11.2037 21.2958 10.7453 21.2959 10.4621 21.0126C10.1795 20.73 10.1795 20.2702 10.4621 19.9876L11.4871 18.9625C11.7696 18.68 12.2295 18.6799 12.5121 18.9625C12.7955 19.2458 12.7955 19.7042 12.5121 19.9876ZM14.5621 22.0376C14.2789 22.3209 13.8204 22.3209 13.5371 22.0376L13.0246 21.5251L13.5371 21.0126C13.7144 20.8352 13.8572 20.6326 13.9624 20.4128L14.5621 21.0126C14.8447 21.2952 14.8447 21.755 14.5621 22.0376ZM20.7122 15.8874C20.4296 16.1701 19.9698 16.1701 19.6872 15.8874L15.5871 11.7873C15.304 11.5043 14.8451 11.5043 14.562 11.7873C14.4205 11.9288 14.3497 12.1144 14.3497 12.2998C14.3497 12.4853 14.4205 12.6708 14.562 12.8123L18.6622 16.9125C18.9455 17.1958 18.9455 17.6542 18.6622 17.9375C18.3796 18.2201 17.9197 18.2201 17.6371 17.9375L13.537 13.8374C13.2541 13.5543 12.795 13.5543 12.512 13.8374C12.3705 13.9789 12.2997 14.1644 12.2997 14.3499C12.2997 14.5354 12.3704 14.7209 12.512 14.8624L16.6121 18.9625C16.8947 19.2451 16.8947 19.7049 16.6121 19.9875C16.3295 20.2702 15.8697 20.27 15.5871 19.9875L13.537 17.9374C13.1436 17.5439 12.6355 17.3334 12.1192 17.3052C12.091 16.7889 11.8805 16.2809 11.487 15.8873C11.0938 15.4942 10.5862 15.2837 10.0704 15.2552C10.0415 14.7194 9.81932 14.2196 9.43696 13.8373C9.04349 13.4438 8.53546 13.2333 8.01923 13.2051C7.99101 12.6888 7.78045 12.1808 7.38698 11.7873C6.80545 11.2057 5.9737 11.0232 5.23499 11.2396L4.62862 9.42057L9.12023 4.92896L10.6578 5.44149L9.43696 6.6623C8.58721 7.51205 8.58707 8.8875 9.43696 9.73735C10.2868 10.5871 11.6622 10.5872 12.5121 9.73735L14.0496 8.1998C14.2414 8.39161 17.1321 11.2823 20.7122 14.8624C20.9955 15.1457 20.9955 15.6042 20.7122 15.8874ZM15.0746 3.07468L16.0997 2.04966L22.2498 8.1998L21.2247 9.22482C21.0507 9.05082 15.4375 3.43763 15.0746 3.07468Z"
                      fill="#636278"></path>
              </g>
              <defs data-v-31450254="">
                <clipPath data-v-31450254="" id="clip0">
                  <rect data-v-31450254="" width="24" height="24" fill="white"></rect>
                </clipPath>
              </defs>
            </svg>
            <span data-v-31450254="">Контакты и корп. информация</span>
            <div data-v-31450254="" class="arrow">
              <svg data-v-31450254="" width="9" height="16" viewBox="0 0 9 16" fill="none"
                   xmlns="http://www.w3.org/2000/svg">
                <path data-v-31450254=""
                      d="M1.99981 14.9999C1.76615 15.0004 1.53972 14.919 1.35981 14.7699C1.25855 14.686 1.17485 14.5829 1.11349 14.4665C1.05214 14.3502 1.01435 14.2229 1.00227 14.0919C0.990194 13.9609 1.00408 13.8289 1.04312 13.7033C1.08217 13.5777 1.1456 13.461 1.22981 13.3599L5.70981 7.99994L1.38981 2.62994C1.30674 2.52765 1.24471 2.40996 1.20728 2.28362C1.16985 2.15728 1.15775 2.02479 1.17169 1.89376C1.18563 1.76273 1.22533 1.63575 1.2885 1.52011C1.35168 1.40447 1.43708 1.30246 1.53981 1.21994C1.64327 1.1289 1.76444 1.06024 1.8957 1.01825C2.02696 0.976258 2.16549 0.961855 2.30258 0.97594C2.43967 0.990024 2.57238 1.03229 2.69236 1.1001C2.81234 1.1679 2.91701 1.25977 2.99981 1.36994L7.82981 7.36994C7.97689 7.54887 8.05729 7.77332 8.05729 8.00494C8.05729 8.23657 7.97689 8.46101 7.82981 8.63994L2.82981 14.6399C2.72949 14.761 2.60206 14.8566 2.45785 14.9192C2.31364 14.9817 2.15671 15.0094 1.99981 14.9999Z"
                      fill="white"></path>
              </svg>
            </div>
          </div>
        </div>
        <div data-v-31450254="" class="content" v-show="tab === 'cooperation'">
          <h5 data-v-31450254="">Контакты и корпоративная информация</h5>
          <p data-v-31450254=""><em data-v-31450254="">Внимание!</em> Только по вопросам рекламы и сотрудничества.<br
              data-v-31450254=""></p>
          <p data-v-31450254=""><em data-v-31450254="">GMDROP.GG</em> <br data-v-31450254=""> Если у Вас есть
            предложение или Вы хотите начать сотрудничество - пишите <a data-v-31450254=""
                                                                        href="https://vk.com/im?media=&amp;sel=645315328"
                                                                        target="_blank">менеджеру.</a> <br
                data-v-31450254=""> По всем остальным вопросам - <a data-v-31450254=""
                                                                    href="mailto:gmdrop@protonmail.com" target="_blank">gmdrop@protonmail.com</a><br
                data-v-31450254=""><br data-v-31450254=""></p>
          <p data-v-31450254=""></p></div>
        <div data-v-31450254="" class="content" v-show="tab === 'agreement'"><h5 data-v-31450254="">GMDROP.GG</h5>
          <p data-v-31450254=""><em data-v-31450254="">Внимание!</em> Пожалуйста, ознакомьтесь с настоящим
            пользовательским соглашением до начала использования сайта gmdrop.gg и его программных средств.<br
                data-v-31450254=""><br data-v-31450254=""> Регистрация (авторизация) на сайте будет означать ваше
            согласие с условиями настоящего пользовательского соглашения.<br data-v-31450254=""><br data-v-31450254="">
            Если Вы не согласны с условиями настоящего пользовательского соглашения, не регистрируйтесь
            (авторизируйтесь) на сайте и не используйте его программные средства.</p><h5 data-v-31450254="">
            Пользовательское соглашение</h5>
          <p data-v-31450254="">GMDROP.GG с одной стороны и лицо, акцептовавшее оферту, размещенную в сети Интернет по
            постоянному адресу https://gmdrop.gg/cooperation?tab=agreement, с другой стороны, заключили настоящее
            пользовательское соглашение о нижеследующем. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">1.</em> Термины и определения <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254=""> 1.1.</em> В настоящем пользовательском соглашении, если из текста прямо не вытекает
            иное, следующие термины будут иметь указанные ниже значения: <br data-v-31450254=""><br data-v-31450254="">
            «Steam», «Служба Steam» <br data-v-31450254=""><br data-v-31450254=""> Онлайновая услуга, предлагаемая
            корпорацией Valve, являющейся правообладателем объектов Инвентаря. <br data-v-31450254=""><br
                data-v-31450254=""> «Владелец» <br data-v-31450254=""><br data-v-31450254=""> GMDROP.GG <br
                data-v-31450254=""><br data-v-31450254=""> «Инвентарь» <br data-v-31450254=""><br data-v-31450254="">
            Возможность использовать один из указанных в Кейсе объектов в соответствии с соглашением подписчика службы
            Steam, размещенным в сети Интернет по адресу: http://store.steampowered.com/subscriber_agreement/russian/.
            <br data-v-31450254=""><br data-v-31450254=""> «Кейс» <br data-v-31450254=""><br data-v-31450254="">
            Совокупность защищенных страниц Сайта, созданных в результате регистрации Пользователя, используя которые
            Пользователь имеет возможность пользоваться всеми или некоторыми функциональными возможностями Сайта. <br
                data-v-31450254=""><br data-v-31450254=""> Доступ в Личный кабинет осуществляется в следующем порядке:
            нажатие кнопки «Авторизироваться через Steam» на Сайте, после чего Пользователь будет автоматически
            перенаправлен на сайт в сети Интернет по адресу: https://steamcommunity.com/. внесение Пользователем имени
            пользователя (подписчика) Steam и пароля в специальную форму, нажатие кнопки «Войти», расположенные в сети
            Интернет по адресу https://steamcommunity.com/. либо посредством открытия Сайта в случае, если Пользователь
            ранее не производил выход из Личного кабинета путем нажатия кнопки «Выход». <br data-v-31450254=""><br
                data-v-31450254=""> «Пользователь» <br data-v-31450254=""><br data-v-31450254=""> Физическое лицо,
            имеющее аккаунт Steam, заключившее с Владельцем Соглашение. <br data-v-31450254=""><br data-v-31450254="">
            «Сайт» <br data-v-31450254=""><br data-v-31450254=""> Составные произведения, представляющие собой
            совокупность информации, текстов, графических элементов, дизайна, изображений, фото и видеоматериалов,
            программ для ЭВМ, иных результатов интеллектуальной деятельности, за исключением Инвентаря, содержащихся в
            информационной системе, обеспечивающей доступность такой информации в сети Интернет в пределах доменной зоны
            gmdrop.gg. «Соглашение» <br data-v-31450254=""><br data-v-31450254=""> Настоящее пользовательское
            соглашение. <br data-v-31450254=""><br data-v-31450254=""> «Стороны» <br data-v-31450254=""><br
                data-v-31450254=""> Владелец и Пользователь. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">1.2.</em> Все остальные термины и определения, встречающиеся в тексте Соглашения,
            толкуются Сторонами в соответствии с законодательством Российской Федерации и сложившимися в сети Интернет
            обычными правилами толкования соответствующих терминов. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">1.3.</em> Названия заголовков (статей) Соглашения предназначены исключительно для
            удобства пользования текстом Соглашения и буквального юридического значения не имеют. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">2.</em> Заключение Соглашения <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">2.1.</em> Текст Соглашения, постоянно
            размещенный в сети Интернет по сетевому адресу https://gmdrop.gg/cooperation?tab=agreement и доступный при
            регистрации (авторизации) на Сайте, содержит все существенные условия Соглашения и является предложением
            Владельца заключить Соглашение с любым полностью дееспособным третьим лицом, использующим Сайт, на указанных
            в тексте Соглашения условиях.Таким образом, текст Соглашения является публичной офертой в соответствии с
            пунктом 2 статьи 437 Гражданского кодекса Российской Федерации. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">2.2.</em> Надлежащим акцептом настоящей оферты в соответствии
            со статьей 438 Гражданского кодекса Российской Федерации считается последовательное осуществление третьим
            лицом, следующих действий: <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">2.2.1.</em>
            Ознакомление с условиями Соглашения; <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">2.2.2.</em>
            Проставление символа в специальном поле под заголовком «Я принимаю условия пользовательского соглашения»;
            <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">2.2.3.</em> Авторизация на Сайте путем
            перехода по ссылке «Авторизироваться через Steam» и осуществления авторизации в открывшемся окне через уже
            имеющийся аккаунт Steam или путем создания нового аккаунта Steam. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">3.</em> Предмет Соглашения <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">3.1.</em> Владелец предоставляет Пользователю: <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">3.1.1.</em> Безвозмездную простую
            (неисключительную) лицензию на использование Сайта и его программных средств по их прямому назначению, как
            то предусмотрено явными пользовательскими функциями Сайта и Личного кабинета; <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">3.1.2.</em> Возмездную простую (неисключительную) лицензию на
            использование Кейса по его прямому назначению, при этом стоимость лицензии на использование определенного
            Кейса указана на Сайте. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">3.2.</em>
            Указанная в пункте 3.1.1 Соглашения лицензия предоставляется Пользователю на срок, в течение которого, и в
            пределах территории, на которой Сайт и Личный кабинет остаются доступными для Пользователя. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">3.3.</em> Указанная в пункте 3.1.2
            Соглашения лицензия предоставляется Пользователю в пределах территории, на которой Кейс остается доступным
            для Пользователя в течение срока с момента оплаты Пользователем вознаграждения за использование конкретного
            Кейса до момента определения Инвентаря с помощью такого Кейса. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">3.4.</em> Пользователю запрещается: <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">3.4.1.</em> обходить технические ограничения, установленные на
            Сайте и в Кейсе;<br data-v-31450254=""><em data-v-31450254="">3.4.2.</em> изучать технологию,
            декомпилировать или дизассемблировать Сайт, Кейс и Личный кабинет, за исключением случаев, прямо
            предусмотренных законодательством Российской Федерации;<br data-v-31450254=""><em
                data-v-31450254="">3.4.3.</em> создавать копии экземпляров Сайта, Кейсов и Личного кабинета, а также их
            внешнего оформления (дизайна);<br data-v-31450254=""><em data-v-31450254="">3.4.4.</em> изменять Сайт, Кейсы
            и Личный кабинет каким бы то ни было способом;<br data-v-31450254=""><em data-v-31450254="">3.4.5.</em>
            совершать действия, направленные на изменение функционирования и работоспособности Сайта, Кейсов и Личного
            кабинета;<br data-v-31450254=""><em data-v-31450254="">3.4.6.</em> предоставлять доступ к Личному кабинету
            третьему лицу;<br data-v-31450254=""><em data-v-31450254="">3.4.7.</em> осуществлять указанные выше действия
            в отношении любой части Сайта, Кейсов и Личного кабинета. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">4.</em> Функции Сайта, Кейса и Личного кабинета <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">4.1.</em> Пользователь посредством Сайта имеет возможность:<br
                data-v-31450254=""><em data-v-31450254="">4.1.1.</em> знакомиться с содержанием и характеристиками
            Инвентаря, выбор которого происходит посредством определенного Кейса, и стоимостью лицензии на использование
            такого Кейса;<br data-v-31450254=""><em data-v-31450254="">4.1.2.</em> приобретать лицензию на использование
            Кейса и получать соответствующий Инвентарь в порядке, указанном в Соглашении.<br data-v-31450254=""><br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">4.2.</em> Пользователь посредством
            Кейса имеет возможность получить один из предоставленных на странице, содержащей Кейс, Инвентарей. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">4.3.</em> Пользователь посредством
            Личного кабинета имеет возможность:<br data-v-31450254=""><em data-v-31450254="">4.3.1.</em> принять
            Инвентарь в аккаунт Steam;<br data-v-31450254=""><em data-v-31450254=""> 4.3.2.</em> осуществить путем
            совершения действия или бездействия в течение 1 (одного) часа с момента получения Инвентаря посредством
            использования Кейса отчуждение Инвентаря за бонусные баллы, в количестве, указанном в описании Инвентаря в
            Личном кабинете, дающие право на получение скидки при оплате лицензионного вознаграждения за Кейсы. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">5.</em> Приемка Инвентаря <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">5.1.</em> С момента получения Инвентаря
            посредством использования Кейса и его отображением в Личном кабинете, Пользователь в течение 1 (одного) часа
            имеет возможность принять Инвентарь в аккаунт Steam, либо осуществить отчуждение Инвентарь посредством
            Личного кабинета. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">5.2.</em> Приемка
            Инвентаря в аккаунт Steam осуществляется при условии выполнения Пользователем указанных на Сайте и в Личном
            кабинете настроек аккаунта Steam и Личного кабинета. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">5.3.</em> Для приемки Инвентаря в аккаунт Steam при условии соблюдения требований
            пункта 5.2 Соглашения, Пользователь в течение 1 (одного) часа с момента получения Инвентаря переходит по
            ссылке «ЗАБРАТЬ», расположенной в Личном кабинете непосредственно в описании такого Инвентаря. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254=""> 5.4.</em> Пользователь имеет
            возможность осуществить отчуждение полученного, но ещё не принятого в аккаунт Steam Инвентаря за указанное в
            описании Инвентаря в Личном кабинете количество бонусных баллов, дающих право на скидку при оплате
            лицензионного вознаграждения за Кейсы, при этом один бонусный балл дает право на скидку в один рубль
            исключительно для указанных целей (оплата лицензионного вознаграждения). Стороны согласовали, что указанные
            бонусные баллы не являются денежными средствами и не подлежат возврату и/или обмену. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">5.5.</em> Для отчуждения Инвентаря Пользователь в течение 1
            (одного) часа с момента получения Инвентаря переходит по соответствующей ссылке, расположенной в Личном
            кабинете непосредственно с описанием такого Инвентаря. Бездействие Пользователя по истечении 1 (одного) часа
            с момента получения Инвентаря означает отчуждение им полученного, но ещё не принятого в аккаунт Steam
            Инвентаря. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">5.6.</em> При отчуждении
            Инвентаря полученные Пользователем бонусные баллы отображаются в Личном кабинете. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">5.7.</em> При полонении счета, с использованием способов
            оплаты банковскими картами/электронными средствами платежа или через сервис «SkinPay» возврат денежных
            средств со счета не предусмотрен и может быть произведен только в качестве инвентаря в аккаунт игры Standoff
            2, если не было нарушено ни одно правило из пунктов данного соглашения. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">6. </em>Вознаграждение Владельца <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">6.1.</em> За предоставленное Владельцем право использования
            Кейса Пользователь выплачивает лицензионное вознаграждение в размере, указанном на Сайте и соответствующей
            странице Кейса. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">6.2.</em> Указанное в
            пункте 6.1 Соглашения лицензионное вознаграждение выплачивается Пользователем из денежных средств, заранее
            переданных Владельцу посредством платежного сервиса, информация о котором доступна Пользователю в момент
            оплаты. Сумма заранее переданных денежных средств отображается в Личном кабинете. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">6.3.</em> Передача денежных средств Владельцу в счет оплаты
            указанного в пункте 6.1 Соглашения лицензионного вознаграждения осуществляется Пользователем способом, в
            порядке и по правилам, указанным на соответствующей странице Сайта, с учетом особенностей и требований,
            устанавливаемых соответствующим платежным сервисом, привлеченным Владельцем для осуществления расчетов. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">6.4.</em> Моментом выплаты указанного в
            пункте 6.1 Соглашения лицензионного вознаграждения является момент списания соответствующей суммы денежных
            средств, заранее переданных Владельцу, о чем Пользователь информируется соответствующим изменением баланса в
            Личном кабинете. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">6.5.</em> Оплата
            указанного в пункте 6.1 Соглашения лицензионного вознаграждения в порядке, предусмотренном настоящим
            разделом, осуществляется с учетом положения пункта 5.6 Соглашения. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">7.</em> Персональные данные <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">7.1.</em> Пользователь дает свое согласие Владельцу на
            обработку информации, в том числе, персональных данных Пользователя, предоставленных при использовании
            Сайта, а именно данных, указанных в аккаунте Пользователя в Steam. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">7.2. </em>Обработка персональных данных означает запись,
            систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу
            (распространение, предоставление, доступ), в том числе трансграничную, обезличивание, блокирование,
            удаление, уничтожение персональных данных, не подпадающих под специальные категории, на обработку которых,
            согласно действующему законодательству Российской Федерации, требуется письменное согласие Пользователя. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">7.3.</em> Обработка персональных данных
            производится в целях исполнения Сторонами обязательств по Соглашению, регистрации Пользователя на Сайте,
            приобретения лицензии на использование Кейса, получения Инвентаря, направления на адрес электронной почты
            Пользователя сообщений информационного и иного характера. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">7.4.</em> Пользователь может в любое время отозвать согласие на обработку
            персональных данных, направив Владельцу соответствующее письменное уведомление на адрес, указанный в пункте
            1.1 Соглашения, заказным письмом с уведомлением о вручении. При этом Пользователь понимает, что такой отзыв
            означает прекращение действия Соглашения. Владелец вправе продолжить обработку персональных данных
            Пользователя в предусмотренных законом случаях. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">7.5.</em> Дополнительные или иные положения в отношении обработки персональных данных
            могут содержаться в соответствующем документе, размещенном или размещаемом на Сайте. В случае, противоречия
            положений такого документа положениям настоящего раздела применяются положения документа. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">7.6.</em> Пользователь дает согласие на
            получение рекламных материалов от Владельца, его аффилированных лиц либо от иных лиц по поручению Владельца
            на адрес электронной почты, указанный Пользователем при регистрации в аккаунте Steam. Согласие на получение
            рекламных материалов может быть отозвано Пользователем в любое время путем направления Владельцу
            соответствующего письменного уведомления на адрес, указанный в пункте 1.1 Соглашения, либо путем совершения
            действий, указанных в сообщениях (электронных письмах), содержащих такие материалы. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">8.</em> Ограничение ответственности <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254=""> 8.1.</em> Владелец не отвечает за
            убытки Пользователя, возникшие в результате неправомерных действий третьих лиц, в том числе связанных с
            неправомерным доступом к Личному кабинету. Владелец не несет ответственность за убытки, причиненные
            Пользователю в результате разглашения третьим лицам учетных данных, необходимых для доступа к Личному
            кабинету, произошедшего не по вине Владельца. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">8.2.</em> Владелец не является правообладателем объектов Инвентаря, не определяет
            порядок использования и функционирование Инвентаря. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">8.3.</em> В отношении Инвентаря Пользователь руководствуется лицензионным соглашением
            Steam, доступным на момент составления редакции Соглашения по адресу
            http://store.steampowered.com/subscriber_agreement/russian/. Владелец не предоставляет программные средства
            для использования Инвентаря по прямому назначению на устройстве Пользователя. Такие программные средства
            Пользователь приобретает и/или устанавливает на свое устройство самостоятельно. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">8.4.</em> Сайт и его программные средства, в том числе Личный
            кабинет и Кейсы, предоставляются «Как есть». На Пользователе лежит риск использования Сайта. Владелец,
            операторы проводной и беспроводной связи, по сетям которых предоставляется доступ к Сайту, аффилированные
            лица, поставщики, агенты Владельца не предоставляют каких бы то ни было гарантий в отношении Сайта. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">8.5.</em> Владелец не гарантирует, что
            Сайт, Кейсы и Личный кабинет соответствуют требованиям Пользователя, что доступ к Сайту, Кейсам и Личному
            кабинету будет предоставляться непрерывно, быстро, надежно и без ошибок. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">8.6.</em> Программно-аппаратные ошибки, как на стороне
            Владельца, так и на стороне Пользователя, приведшие к невозможности получения Пользователем доступа к Сайту
            и/или Кейсу, и/или Личному кабинету, являются обстоятельствами непреодолимой силы, и основанием освобождения
            от ответственности за неисполнение обязательств Владельца по Соглашению. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">8.7.</em> Владелец вправе уступать права и переводить долги,
            по всем обязательствам, возникшим из Соглашения. Настоящим Пользователь дает свое согласие на уступку прав и
            перевод долга любым третьим лицам. О состоявшейся уступке прав и/или переводе долга Владелец информирует
            Пользователя, размещая соответствующую информацию на Сайте. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">8.8.</em> Размер убытков, которые могут быть возмещены
            Владельцем Пользователю, в любом случае ограничен в соответствии с положениями части 1 статьи 15
            Гражданского кодекса Российской Федерации суммой в 1 000 (одну тысячу) рублей. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">8.9.</em> Размер убытков, которые могут быть возмещены
            Владельцем Пользователю, в любом случае ограничен в соответствии с положениями части 1 статьи 15
            Гражданского кодекса Российской Федерации суммой в 1 000 (одну тысячу) рублей. Если иное не предусмотрено
            Соглашением в случае нарушения Пользователем условий Соглашения Владелец вправе в одностороннем порядке
            отказаться от исполнения Соглашения и прекратить доступ Пользователя к Личному кабинету. В случае если такое
            нарушение причинило ущерб третьим лицам, ответственность за них полностью лежит на Пользователе. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">9.</em> Порядок разрешения споров <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">9.1.</em> Все споры, разногласия и
            претензии, которые могут возникнуть в связи с исполнением, расторжением или признанием недействительным
            Соглашения, Стороны будут стремиться решить путем переговоров. Сторона, у которой возникли претензии и/или
            разногласия, направляет другой Стороне сообщение с указанием возникших претензий и/или разногласий в
            соответствии с пунктом 9.1 Соглашения. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">9.2.</em>
            В случае если ответ на сообщение не будет получен направившей сообщение Стороной в течение 30 (тридцати)
            рабочих дней с даты направления соответствующего сообщения, либо если Стороны не придут к соглашению по
            возникшим претензиям и/или разногласиям, спор подлежит разрешению в судебном порядке по месту нахождения
            Владельца. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">10.</em> Заключительные
            положения <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">10.1.</em> Настоящим Стороны
            подтверждают, что при исполнении (изменении, дополнении, прекращении) Соглашения, а также при ведении
            переписки по указанным вопросам, допускается использование аналогов собственноручной подписи Сторон. Стороны
            подтверждают, что все уведомления, сообщения, соглашения и документы в рамках исполнения Сторонами
            обязательств, возникших из Соглашения, подписанные аналогами собственноручной подписи Сторон, имеют
            юридическую силу и обязательны для исполнения Сторонами. Под аналогами собственноручной подписи понимаются
            уполномоченные адреса электронной почты и учетные данные к Личному кабинету. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">10.2.</em> Стороны признают, что все уведомления, сообщения,
            соглашения, документы и письма, направленные с использованием уполномоченных адресов электронной почты и
            Личного кабинета, считаются направленными и подписанными Сторонами, кроме случаев, когда в таких письмах
            прямо не указано обратное. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">10.3.</em>
            Уполномоченными адресами электронной почты Сторон признаются:<br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">10.3.1.</em> для Владельца: gmdrop@protonmail.com;<br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">10.3.2.</em> для Пользователя: адрес
            электронной почты, указанный при регистрации аккаунта в Steam. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">10.4.</em> Стороны обязуются обеспечивать конфиденциальность
            сведений и информации, необходимых для доступа к уполномоченным адресам электронной почты и Личному
            кабинету, не допускать разглашение такой информации и передачу третьим лицам. Стороны самостоятельно
            определяют порядок ограничения доступа к такой информации. <br data-v-31450254=""><br data-v-31450254=""><em
                data-v-31450254="">10.5.</em> При использовании уполномоченных адресов электронной почты, до момента
            получения от второй Стороны информации о нарушении режима конфиденциальности, все действия и документы,
            совершенные и направленные с помощью уполномоченного адреса электронной почты второй Стороны, даже если
            такие действия и документы были совершены и направлены иными лицами, считаются совершенными и направленными
            такой второй Стороной. В этом случае права и обязанности, а также ответственность наступают у такой второй
            Стороны. <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">10.6.</em> При использовании
            Личного кабинета, до момента получения от Пользователя информации о нарушении режима конфиденциальности, все
            действия и документы, совершенные и направленные с помощью Личного кабинета, даже если такие действия и
            документы были совершены и направлены иными лицами, считаются совершенными и направленными Пользователем. В
            этом случае права и обязанности, а также ответственность наступают у Пользователя. <br
                data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">11.</em> Изменение условий Соглашения
            <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">11.1.</em> Владелец вправе в
            одностороннем порядке изменять условия Соглашения, при этом такие изменения вступают в силу в момент
            опубликования новой версии Соглашения в сети Интернет по адресу https://gmdrop.gg/cooperation?tab=agreement.
            <br data-v-31450254=""><br data-v-31450254=""><em data-v-31450254="">11.2.</em> Продолжение использования
            функций Сайта будет означать согласие Пользователя с условиями новой версии Соглашения. Если Пользователь не
            согласен с условиями новой версии Соглашения, он прекращает пользоваться Сайтом. <br data-v-31450254=""><br
                data-v-31450254=""><em data-v-31450254="">11.3.</em> Во всем остальном, что не урегулировано
            Соглашением, Стороны руководствуются действующим законодательством Российской Федерации без учета его
            коллизионных норм.</p><h5 data-v-31450254="">ADDITIONAL TERMS AND CONDITIONS; EULAS</h5>
          <p data-v-31450254=""> When you use G2A Pay services provided by G2A.COM Limited (hereinafter referred to as
            the "G2A Pay services provider") to make a purchase on our website, responsibility over your purchase will
            first be transferred to G2A.COM Limited before it is delivered to you. G2A Pay services provider assumes
            primary responsibility, with our assistance, for payment and payment related customer support. The terms
            between G2A Pay services provider and customers who utilize services of G2A Pay are governed by separate
            agreements and are not subject to the Terms on this website. <br data-v-31450254=""><br data-v-31450254="">
            With respect to customers making purchases through G2A Pay services provider checkout, (i) the Privacy
            Policy of G2A Pay services provider shall apply to all payments and should be reviewed before making any
            purchase, and (ii) the G2A Pay services provider Refund Policy shall apply to all payments unless notice is
            expressly provided by the relevant supplier to buyers in advance. In addition the purchase of certain
            products may also require shoppers to agree to one or more End-User License Agreements (or "EULAs") that may
            include additional terms set by the product supplier rather than by Us or G2A Pay services provider. You
            will be bound by any EULA that you agree to. <br data-v-31450254=""><br data-v-31450254=""> We and/or
            entities that sell products on our website by using G2A Pay services are primarily responsible for warranty,
            maintenance, technical or product support services for those Products. We and/or entities that sell products
            on our website are primarily responsible to users for any liabilities related to fulfillment of orders, and
            EULAs entered into by the End-User Customer. G2A Pay services provider is primarily responsible for
            facilitating your payment. <br data-v-31450254=""><br data-v-31450254=""> You are responsible for any fees,
            taxes or other costs associated with the purchase and delivery of your items resulting from charges imposed
            by your relationship with payment services providers or the duties and taxes imposed by your local customs
            officials or other regulatory body. <br data-v-31450254=""><br data-v-31450254=""> Questions related to
            payments made through G2A Pay services provider payment should be addressed to support@g2a.com. Where
            possible, we will work with you and/or any user selling on our website, to resolve any disputes arising from
            your purchase. <br data-v-31450254=""><br data-v-31450254=""> For customer service inquiries or disputes,
            You may contact us by email at <a data-v-31450254="" href="mailto:gmdrop@protonmail.com" target="_blank">gmdrop@protonmail.com</a>.
          </p></div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      tab: 'agreement'
    }
  },
  watch: {
    '$route.query'() {
      this.tab = this.$route.query.tab
    }
  },
  created() {
    if (typeof this.$route.query.tab !== 'undefined') {
      this.tab = this.$route.query.tab
    }
  }
}
</script>