<template>
  <div data-v-7b79ffd9="" class="partners" style="" v-if="$root.user">
    <div data-v-7b79ffd9="" class="container">
      <div data-v-7b79ffd9="" class="page__title blue"><span data-v-7b79ffd9="">ПАРТНЕРКА</span></div>
      <div data-v-7b79ffd9="" class="first__wrapper">
        <div data-v-7b79ffd9="" class="referal">
          <div data-v-7b79ffd9="" class="title">Реферальная система</div>
          <div data-v-7b79ffd9="" class="separator"></div>
          <label data-v-7b79ffd9="" for="input1">Ваша реферальная ссылка</label>
          <div data-v-7b79ffd9="" class="input">
            <input ref="refLinkRef" data-v-6fcbaddf="" :value="domain + '/r/' + $root.user.referral_code"
                   data-v-7b79ffd9="" type="text" readonly="readonly" id="input1">
            <svg @click="makeTextSelection" data-v-7b79ffd9="" width="30" height="30" viewBox="0 0 30 30" fill="none"
                 xmlns="http://www.w3.org/2000/svg" class="copy">
              <path data-v-7b79ffd9=""
                    d="M12 3C11.2044 3 10.4413 3.31607 9.87868 3.87868C9.31607 4.44129 9 5.20435 9 6V21C9 21.7956 9.31607 22.5587 9.87868 23.1213C10.4413 23.6839 11.2044 24 12 24H21C21.7956 24 22.5587 23.6839 23.1213 23.1213C23.6839 22.5587 24 21.7956 24 21V6C24 5.20435 23.6839 4.44129 23.1213 3.87868C22.5587 3.31607 21.7956 3 21 3H12ZM10.5 6C10.5 5.60218 10.658 5.22064 10.9393 4.93934C11.2206 4.65804 11.6022 4.5 12 4.5H21C21.3978 4.5 21.7794 4.65804 22.0607 4.93934C22.342 5.22064 22.5 5.60218 22.5 6V21C22.5 21.3978 22.342 21.7794 22.0607 22.0607C21.7794 22.342 21.3978 22.5 21 22.5H12C11.6022 22.5 11.2206 22.342 10.9393 22.0607C10.658 21.7794 10.5 21.3978 10.5 21V6Z"
                    fill="#3D3B54"></path>
              <path data-v-7b79ffd9=""
                    d="M6 9.0001C6.00001 8.4735 6.13864 7.95619 6.40194 7.50014C6.66525 7.0441 7.04395 6.6654 7.5 6.4021V21.7501C7.5 22.7447 7.89509 23.6985 8.59835 24.4017C9.30161 25.105 10.2554 25.5001 11.25 25.5001H20.598C20.3347 25.9561 19.956 26.3349 19.5 26.5982C19.0439 26.8615 18.5266 27.0001 18 27.0001H11.25C9.85761 27.0001 8.52226 26.447 7.53769 25.4624C6.55312 24.4778 6 23.1425 6 21.7501V9.0001Z"
                    fill="#3D3B54"></path>
            </svg>
          </div>
        </div>
      </div>
      <div data-v-7b79ffd9="" class="second__wrapper">
        <div data-v-7b79ffd9="" class="your-level">
          <div data-v-7b79ffd9="" class="title">Ваш уровень</div>
          <div data-v-7b79ffd9="" class="separator"></div>
          <div data-v-7b79ffd9="" class="stats">
            <div data-v-7b79ffd9="" class="indicators">
              <div data-v-7b79ffd9="" class="place">{{ $root.user.referral_lvl }}</div>
              <div data-v-7b79ffd9="" class="blocks">
                <div data-v-7b79ffd9="" class="block">
                  <div data-v-7b79ffd9="" class="text"><span data-v-7b79ffd9="">Ваш процент</span><em
                      data-v-7b79ffd9="">5%</em></div>
                </div>
                <div data-v-7b79ffd9="" class="block">
                  <svg data-v-7b79ffd9="" width="30" height="30" viewBox="0 0 30 30" fill="none"
                       xmlns="http://www.w3.org/2000/svg">
                    <path data-v-7b79ffd9=""
                          d="M20.8391 17.1919C20.7034 17.1439 20.565 17.094 20.4266 17.0426V14.564C20.6809 14.6517 20.8125 14.7792 20.8299 14.797C21.0962 15.0979 21.556 15.128 21.8595 14.8637C22.1645 14.5979 22.1963 14.1353 21.9305 13.8303C21.6803 13.5431 21.1615 13.1828 20.4266 13.06V12.6562C20.4266 12.2518 20.0987 11.9238 19.6942 11.9238C19.2897 11.9238 18.9618 12.2518 18.9618 12.6562V13.1412C18.9105 13.1545 18.8587 13.1689 18.8064 13.1847C17.9209 13.4514 17.2596 14.2075 17.0805 15.1579C16.9163 16.0294 17.1989 16.8724 17.8178 17.3578C18.1141 17.5903 18.4759 17.8033 18.9617 18.0251V21.2428C18.6074 21.1956 18.3422 21.0797 17.927 20.808C17.5885 20.5865 17.1345 20.6815 16.9131 21.02C16.6916 21.3584 16.7865 21.8123 17.125 22.0339C17.8432 22.5037 18.3481 22.6656 18.9617 22.7163V23.2031C18.9617 23.6076 19.2896 23.9355 19.6942 23.9355C20.0987 23.9355 20.4266 23.6076 20.4266 23.2031V22.6478C20.9079 22.5301 21.3456 22.2969 21.7162 21.9564C22.2118 21.501 22.5463 20.884 22.6581 20.2191C22.8881 18.852 22.174 17.6638 20.8391 17.1919ZM18.9618 16.3714C18.875 16.3171 18.794 16.2618 18.7219 16.2052C18.5377 16.0607 18.4584 15.7561 18.5201 15.4292C18.5666 15.1825 18.7059 14.8961 18.9618 14.7171V16.3714ZM21.2137 19.9763C21.1424 20.4004 20.8757 20.8478 20.4266 21.0901V18.6017C21.2854 18.946 21.2646 19.6733 21.2137 19.9763Z"
                          fill="white" fill-opacity="0.36"></path>
                    <path data-v-7b79ffd9=""
                          d="M29.966 20.8553C29.7027 18.5047 28.9328 16.1937 27.7396 14.1723C26.8047 12.5885 25.6447 11.2109 24.2793 10.0599C24.9069 9.57746 25.3125 8.81978 25.3125 7.96877C25.3125 7.08857 24.8786 6.30834 24.2139 5.82916C25.2862 4.6714 25.8984 3.14269 25.8984 1.52345C25.8984 1.19931 25.72 0.90148 25.4343 0.748492C25.1485 0.59562 24.8017 0.61232 24.532 0.792144C23.2265 1.6625 21.5392 1.6625 20.2337 0.792144C19.9385 0.595328 19.5538 0.595328 19.2586 0.792144C17.9531 1.6625 16.2658 1.6625 14.9603 0.792144C14.6906 0.61232 14.3438 0.596206 14.058 0.749195C13.7723 0.902183 13.5938 1.2006 13.5938 1.52474C13.5938 3.14298 14.206 4.67146 15.2783 5.8291C14.6136 6.30834 14.1797 7.08857 14.1797 7.96877C14.1797 8.82113 14.5866 9.57986 15.2159 10.0622C13.0563 11.891 11.3875 14.31 10.4083 17.0508H3.22266C2.73727 17.0508 2.34375 17.4443 2.34375 17.9297V20.5664H0.878906C0.393516 20.5664 0 20.9599 0 21.4453V24.961C0 25.4463 0.393516 25.8399 0.878906 25.8399H2.34375V28.4766C2.34375 28.962 2.73727 29.3555 3.22266 29.3555H13.7695C14.2549 29.3555 14.6484 28.962 14.6484 28.4766V26.9957C14.7875 27.0061 14.9271 27.0117 15.067 27.0117H24.4266C26.0139 27.0117 27.5316 26.3326 28.5904 25.1486C29.6389 23.9761 30.1403 22.4112 29.966 20.8553ZM19.7461 2.54586C21.0369 3.23164 22.5234 3.38123 23.8996 2.99474C23.5812 3.93722 22.9591 4.76199 22.1075 5.33205H17.3846C16.5332 4.76205 15.9113 3.93757 15.5927 2.9948C16.969 3.38123 18.4553 3.23164 19.7461 2.54586ZM23.5547 7.96877C23.5547 8.45339 23.1604 8.84767 22.6758 8.84767H16.8164C16.3318 8.84767 15.9375 8.45339 15.9375 7.96877C15.9375 7.48414 16.3318 7.08986 16.8164 7.08986H22.6758C23.1604 7.08986 23.5547 7.48414 23.5547 7.96877ZM4.10156 18.8086H12.8906V20.5664H4.10156V18.8086ZM1.75781 24.082V22.3242H10.5469V24.082H1.75781ZM12.8906 27.5977H4.10156V25.8399H12.8906V27.5977ZM27.28 23.9769C26.5543 24.7885 25.5142 25.2539 24.4266 25.2539H15.067C14.9268 25.2539 14.7871 25.2461 14.6484 25.231V24.961C14.6484 24.4756 14.2549 24.082 13.7695 24.082H12.3047V22.3242H13.7695C14.2549 22.3242 14.6484 21.9307 14.6484 21.4453V17.9297C14.6484 17.4443 14.2549 17.0508 13.7695 17.0508H12.2889C13.352 14.4288 15.1295 12.1764 17.3902 10.6055H22.1013C25.5138 12.9734 27.739 16.7647 28.2191 21.0511C28.3395 22.126 28.0061 23.1651 27.28 23.9769Z"
                          fill="white" fill-opacity="0.36"></path>
                  </svg>
                  <div data-v-7b79ffd9="" class="text"><span data-v-7b79ffd9="">Всего заработанных</span><em
                      data-v-7b79ffd9="">{{ $root.user.referral_sum }}₽</em></div>
                </div>
                <div data-v-7b79ffd9="" class="block">
                  <svg data-v-7b79ffd9="" width="30" height="30" viewBox="0 0 30 30" fill="none"
                       xmlns="http://www.w3.org/2000/svg">
                    <path data-v-7b79ffd9=""
                          d="M28.5623 17.6825C27.6569 17.0061 26.5176 16.7979 25.4318 17.1095L15.3566 19.4021C15.126 19.1928 14.8613 19.017 14.5681 18.885L9.39453 16.564C7.88965 15.8868 6.16733 15.8952 4.67335 16.5846L0.515063 18.4768C0.0732787 18.6779 -0.121892 19.1989 0.0791379 19.6408C0.280168 20.0825 0.801286 20.2775 1.24313 20.0767L5.40563 18.1825C6.44172 17.7045 7.63266 17.6987 8.67414 18.1673L13.8477 20.4883C14.045 20.5771 14.2117 20.7133 14.3368 20.8799C15.1116 21.9711 13.9716 23.304 12.8149 22.7834L8.34139 20.7704C7.89867 20.5711 7.37837 20.7685 7.17928 21.2112C6.98012 21.6538 7.17746 22.1741 7.62006 22.3733L12.0936 24.3863C14.3433 25.3989 16.8068 23.4183 16.2782 20.9951C22.8977 19.4889 25.8593 18.816 25.9016 18.8036C27.0737 18.4568 28.2416 19.3338 28.2416 20.55C28.2416 21.1905 27.8993 21.7911 27.3503 22.1164L17.8816 27.6932C16.8828 28.285 15.6816 28.4044 14.5859 28.0205L7.32165 25.4782C7.12584 25.4097 6.91227 25.4126 6.71845 25.4865L0.566273 27.8302C0.112711 28.0029 -0.114978 28.5108 0.0578104 28.9643C0.230657 29.4179 0.738417 29.6454 1.19198 29.4728L7.04404 27.2434L14.005 29.6795C15.5553 30.2225 17.298 30.082 18.7757 29.2066L28.2444 23.6298C30.4384 22.3299 30.6098 19.2121 28.5623 17.6825Z"
                          fill="white" fill-opacity="0.36"></path>
                    <path data-v-7b79ffd9=""
                          d="M4.16062 14.0035H25.7811C26.2665 14.0035 26.66 13.61 26.66 13.1246C26.66 11.7972 26.66 2.10393 26.66 0.878882C26.66 0.393505 26.2665 0 25.7811 0C24.8654 0 5.0562 0 4.16062 0C3.67524 0 3.28174 0.393505 3.28174 0.878882V13.1246C3.28174 13.61 3.67518 14.0035 4.16062 14.0035ZM9.24062 1.75776H20.7597C21.1275 3.86556 22.7944 5.5911 24.9022 5.95894V8.10318C22.7944 8.47102 21.1275 10.138 20.7597 12.2458H9.24062C8.86938 10.1185 7.17489 8.44043 5.03944 8.09345V5.96866C7.17489 5.62168 8.86938 3.88507 9.24062 1.75776ZM5.09809 12.2458V9.90225C6.23455 10.2125 7.13136 11.1094 7.44161 12.2458H5.09809ZM24.9022 12.2458H22.5587C22.869 11.1093 23.7658 10.2125 24.9022 9.90225V12.2458ZM24.9022 1.75776V4.15987C23.7658 3.84962 22.869 2.89422 22.5587 1.75776H24.9022ZM7.44161 1.75776C7.13136 2.89422 6.23449 3.84962 5.09809 4.15987V1.75776H7.44161Z"
                          fill="white" fill-opacity="0.36"></path>
                    <path data-v-7b79ffd9=""
                          d="M14.9999 10.2537C16.7768 10.2537 18.2225 8.80809 18.2225 7.03116C18.2225 5.25424 16.7768 3.80859 14.9999 3.80859C13.223 3.80859 11.7773 5.25424 11.7773 7.03116C11.7773 8.80809 13.223 10.2537 14.9999 10.2537ZM14.9999 5.56636C15.8076 5.56636 16.4647 6.22347 16.4647 7.03116C16.4647 7.83885 15.8076 8.49597 14.9999 8.49597C14.1922 8.49597 13.5351 7.83885 13.5351 7.03116C13.5351 6.22347 14.1922 5.56636 14.9999 5.56636Z"
                          fill="white" fill-opacity="0.36"></path>
                  </svg>
                  <div data-v-7b79ffd9="" class="text"><span data-v-7b79ffd9="">Доступно для вывода</span><em
                      data-v-7b79ffd9="">{{ $root.user.referral_balance }}₽</em></div>
                </div>
              </div>
            </div>
            <div data-v-7b79ffd9="" class="buttons">
              <button @click="toBalance()" data-v-7b79ffd9="" class="orange">На баланс</button>
            </div>
          </div>
          <div data-v-7b79ffd9="" class="progress">
            <div data-v-7b79ffd9="" class="progress__head"><span data-v-7b79ffd9="">До след. уровня</span><span
                data-v-7b79ffd9=""><em data-v-7b79ffd9="">{{ $root.user.referral_sum }}₽</em> из {{
                nextLvlMoney()
              }}₽</span></div>
            <div data-v-7b79ffd9="" class="progress__body">
              <div data-v-7b79ffd9="" class="progress__fill" :style="`width: ${getWidth()}%;`"></div>
            </div>
          </div>
          <div data-v-7b79ffd9="" class="badges">
            <div data-v-7b79ffd9="" class="badge">
              <svg data-v-7b79ffd9="" width="68" height="68" viewBox="0 0 68 68" fill="none"
                   xmlns="http://www.w3.org/2000/svg">
                <path data-v-7b79ffd9="" opacity="0.09"
                      d="M30.2412 2.02072C32.407 0.770295 35.0753 0.770296 37.2411 2.02073L59.4618 14.8498C61.6277 16.1003 62.9618 18.4112 62.9618 20.912V46.5703C62.9618 49.0711 61.6277 51.382 59.4618 52.6325L37.2411 65.4616C35.0753 66.712 32.407 66.712 30.2411 65.4616L8.02045 52.6325C5.85465 51.382 4.52046 49.0711 4.52046 46.5703V20.912C4.52046 18.4112 5.85465 16.1003 8.02046 14.8498L30.2412 2.02072Z"
                      fill="#FFB800"></path>
                <g data-v-7b79ffd9="" filter="url(#filter0_i)">
                  <path data-v-7b79ffd9=""
                        d="M30.7412 10.9204C32.5976 9.84865 34.8848 9.84865 36.7412 10.9204L52.0046 19.7328C53.861 20.8046 55.0046 22.7853 55.0046 24.9289V42.5535C55.0046 44.6971 53.861 46.6779 52.0046 47.7497L36.7412 56.562C34.8848 57.6338 32.5976 57.6338 30.7412 56.562L15.4779 47.7497C13.6214 46.6779 12.4778 44.6971 12.4778 42.5536V24.9289C12.4778 22.7853 13.6214 20.8046 15.4778 19.7328L30.7412 10.9204Z"
                        stroke="#FFBA00" stroke-width="2"></path>
                </g>
                <path data-v-7b79ffd9=""
                      d="M33.499 31.457C35.2792 31.457 36.7275 30.0087 36.7275 28.2285C36.7275 26.4483 35.2792 25 33.499 25C31.7188 25 30.2705 26.4483 30.2705 28.2285C30.2705 30.0087 31.7188 31.457 33.499 31.457ZM33.499 26.1133C34.6654 26.1133 35.6142 27.0622 35.6142 28.2285C35.6142 29.3949 34.6654 30.3437 33.499 30.3437C32.3327 30.3437 31.3838 29.3949 31.3838 28.2285C31.3838 27.0622 32.3327 26.1133 33.499 26.1133Z"
                      fill="white"></path>
                <path data-v-7b79ffd9=""
                      d="M40.0308 31.457C41.1562 31.457 42.0718 30.5414 42.0718 29.416C42.0718 28.2906 41.1562 27.375 40.0308 27.375C38.9053 27.375 37.9897 28.2906 37.9897 29.416C37.9897 30.5414 38.9053 31.457 40.0308 31.457ZM40.0308 28.4883C40.5423 28.4883 40.9585 28.9045 40.9585 29.416C40.9585 29.9276 40.5423 30.3437 40.0308 30.3437C39.5192 30.3437 39.103 29.9276 39.103 29.416C39.103 28.9045 39.5192 28.4883 40.0308 28.4883Z"
                      fill="white"></path>
                <path data-v-7b79ffd9=""
                      d="M40.4802 32.7185H39.6193C38.6048 32.7185 37.729 33.3179 37.3299 34.1788C36.5083 33.2819 35.3281 32.7185 34.0187 32.7185H32.9813C31.6719 32.7185 30.4917 33.2819 29.6701 34.1788C29.271 33.3179 28.3952 32.7185 27.3807 32.7185H26.5197C25.1303 32.7185 24 33.842 24 35.223V39.2757C24 39.8753 24.4896 40.363 25.0915 40.363H28.4954C28.5525 41.0273 29.111 41.5505 29.7899 41.5505H37.2101C37.8889 41.5505 38.4475 41.0273 38.5046 40.363H41.8697C42.4929 40.363 43 39.858 43 39.2371V35.223C43 33.842 41.8696 32.7185 40.4802 32.7185ZM25.1133 35.223C25.1133 34.4559 25.7442 33.8318 26.5197 33.8318H27.3807C28.1562 33.8318 28.7871 34.4559 28.7871 35.223V35.6042C28.4128 36.5788 28.4902 37.1629 28.4902 39.2497H25.1133V35.223ZM37.3965 40.2509C37.3965 40.3537 37.3129 40.4372 37.2101 40.4372H29.7898C29.6871 40.4372 29.6035 40.3536 29.6035 40.2509V37.2095C29.6035 35.347 31.1188 33.8318 32.9812 33.8318H34.0187C35.8812 33.8318 37.3965 35.347 37.3965 37.2095V40.2509ZM41.8867 39.2371C41.8867 39.2563 42.0942 39.2497 38.5097 39.2497C38.5097 37.1475 38.5866 36.5772 38.2129 35.6042V35.223C38.2129 34.4559 38.8438 33.8318 39.6193 33.8318H40.4802C41.2558 33.8318 41.8867 34.4559 41.8867 35.223V39.2371Z"
                      fill="white"></path>
                <path data-v-7b79ffd9=""
                      d="M26.9697 31.457C28.0951 31.457 29.0107 30.5414 29.0107 29.416C29.0107 28.2906 28.0951 27.375 26.9697 27.375C25.8443 27.375 24.9287 28.2906 24.9287 29.416C24.9287 30.5414 25.8443 31.457 26.9697 31.457ZM26.9697 28.4883C27.4813 28.4883 27.8975 28.9045 27.8975 29.416C27.8975 29.9276 27.4813 30.3437 26.9697 30.3437C26.4582 30.3437 26.042 29.9276 26.042 29.416C26.042 28.9045 26.4582 28.4883 26.9697 28.4883Z"
                      fill="white"></path>
                <defs data-v-7b79ffd9="">
                  <filter data-v-7b79ffd9="" id="filter0_i" x="9.47803" y="9.11658" width="46.5268" height="53.2493"
                          filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                    <feFlood data-v-7b79ffd9="" flood-opacity="0" result="BackgroundImageFix"></feFlood>
                    <feBlend data-v-7b79ffd9="" mode="normal" in="SourceGraphic" in2="BackgroundImageFix"
                             result="shape"></feBlend>
                    <feColorMatrix data-v-7b79ffd9="" in="SourceAlpha" type="matrix"
                                   values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                                   result="hardAlpha"></feColorMatrix>
                    <feOffset data-v-7b79ffd9="" dx="-2" dy="4"></feOffset>
                    <feGaussianBlur data-v-7b79ffd9="" stdDeviation="10"></feGaussianBlur>
                    <feComposite data-v-7b79ffd9="" in2="hardAlpha" operator="arithmetic" k2="-1" k3="1"></feComposite>
                    <feColorMatrix data-v-7b79ffd9="" type="matrix"
                                   values="0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0.28 0"></feColorMatrix>
                    <feBlend data-v-7b79ffd9="" mode="normal" in2="shape" result="effect1_innerShadow"></feBlend>
                  </filter>
                </defs>
              </svg>
              <div data-v-7b79ffd9="" class="text"><span data-v-7b79ffd9="">Вы пригласили</span><strong
                  data-v-7b79ffd9="">{{ $root.user.referral_invited }}</strong></div>
            </div>
            <div data-v-7b79ffd9="" class="badge"><img data-v-7b79ffd9="" src="/img/badge2.svg" alt="">
              <div data-v-7b79ffd9="" class="text"><span data-v-7b79ffd9="">Рефералы завели</span><strong
                  data-v-7b79ffd9="">+{{ $root.user.referral_payment }}₽</strong></div>
            </div>
            <div data-v-7b79ffd9="" class="badge">
              <svg data-v-7b79ffd9="" width="69" height="68" viewBox="0 0 69 68" fill="none"
                   xmlns="http://www.w3.org/2000/svg">
                <path data-v-7b79ffd9="" opacity="0.09"
                      d="M31.206 2.02072C33.3718 0.770295 36.0402 0.770296 38.206 2.02073L60.4267 14.8498C62.5925 16.1003 63.9267 18.4112 63.9267 20.912V46.5703C63.9267 49.0711 62.5925 51.382 60.4267 52.6325L38.206 65.4616C36.0402 66.712 33.3718 66.712 31.206 65.4616L8.9853 52.6325C6.81949 51.382 5.4853 49.0711 5.4853 46.5703V20.912C5.4853 18.4112 6.81949 16.1003 8.9853 14.8498L31.206 2.02072Z"
                      fill="#FFB800"></path>
                <g data-v-7b79ffd9="" filter="url(#filter0_i)">
                  <path data-v-7b79ffd9=""
                        d="M31.7061 10.9204C33.5625 9.84865 35.8497 9.84865 37.7061 10.9204L52.9695 19.7328C54.8259 20.8046 55.9695 22.7853 55.9695 24.9289V42.5535C55.9695 44.6971 54.8259 46.6779 52.9695 47.7497L37.7061 56.562C35.8497 57.6338 33.5625 57.6338 31.7061 56.562L16.4427 47.7497C14.5863 46.6779 13.4427 44.6971 13.4427 42.5536V24.9289C13.4427 22.7853 14.5863 20.8046 16.4427 19.7328L31.7061 10.9204Z"
                        stroke="#FFBA00" stroke-width="2"></path>
                </g>
                <path data-v-7b79ffd9=""
                      d="M31.8026 31.8041C31.8026 31.4701 31.5317 31.1992 31.1977 31.1992C30.3924 31.2326 30.3924 32.3793 31.1977 32.4127C31.5317 32.409 31.8026 32.1381 31.8026 31.8041Z"
                      fill="white"></path>
                <path data-v-7b79ffd9=""
                      d="M37.6801 31.1992C37.3461 31.1992 37.0752 31.4701 37.0752 31.8041C37.1086 32.6094 38.2553 32.6094 38.2887 31.8041C38.285 31.4701 38.0141 31.1992 37.6801 31.1992Z"
                      fill="white"></path>
                <path data-v-7b79ffd9=""
                      d="M42.0862 30.8059H41.537V28.6461C41.537 26.0855 39.4514 24 36.8909 24H32.1075C29.5469 24 27.4614 26.0855 27.4614 28.6461V30.8059H26.9159C24.3887 30.9098 24.3887 34.5131 26.9159 34.617H27.4985C27.6877 36.632 28.7342 38.4059 30.2631 39.5637V42.4434C30.2631 42.7514 30.5118 43 30.8198 43H38.1377C38.4458 43 38.6944 42.7514 38.6944 42.4434V39.5971C40.2493 38.4393 41.3143 36.6506 41.5036 34.617H42.0862C44.6133 34.5131 44.6133 30.9098 42.0862 30.8059ZM32.1075 25.1133H36.8909C38.8206 25.1133 40.394 26.6719 40.4237 28.5941C39.7186 27.9039 38.776 27.5217 37.7778 27.5217H31.2243C30.2223 27.5217 29.2834 27.9039 28.5784 28.5941C28.6043 26.6719 30.1778 25.1133 32.1075 25.1133ZM26.1217 32.7096C26.1217 32.2717 26.478 31.9154 26.9159 31.9154H27.4651V33.5H26.9159C26.478 33.5037 26.1217 33.1475 26.1217 32.7096ZM37.5811 41.8867H31.3727V40.2539C33.217 41.215 35.7293 41.2262 37.5811 40.2762V41.8867ZM40.4237 33.9527C40.3495 41.7197 28.6452 41.7012 28.5784 33.9527C28.5784 33.949 28.5784 31.3885 28.5784 31.2475C28.5784 30.5424 28.853 29.8855 29.3502 29.3957C29.8475 28.9059 30.5155 28.635 31.2243 28.635H37.7741C38.4866 28.635 39.1508 28.9059 39.6481 29.3957C40.1454 29.8855 40.42 30.5424 40.42 31.2475L40.4237 33.9527ZM42.0862 33.5037H41.537V31.9191H42.0862C43.1401 31.9637 43.1364 33.4592 42.0862 33.5037Z"
                      fill="white"></path>
                <path data-v-7b79ffd9=""
                      d="M37.6392 35.1476C37.3609 35.0177 37.0306 35.1402 36.9008 35.4185C35.9508 37.3371 32.9969 37.1812 32.0914 35.4C31.9504 35.1254 31.6164 35.0177 31.3418 35.1588C31.0672 35.2998 30.9595 35.6338 31.1006 35.9084C32.4662 38.5877 36.6336 38.5765 37.9101 35.8898C38.04 35.6078 37.9176 35.2775 37.6392 35.1476Z"
                      fill="white"></path>
                <defs data-v-7b79ffd9="">
                  <filter data-v-7b79ffd9="" id="filter0_i" x="10.4429" y="9.11658" width="46.5268" height="53.2493"
                          filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                    <feFlood data-v-7b79ffd9="" flood-opacity="0" result="BackgroundImageFix"></feFlood>
                    <feBlend data-v-7b79ffd9="" mode="normal" in="SourceGraphic" in2="BackgroundImageFix"
                             result="shape"></feBlend>
                    <feColorMatrix data-v-7b79ffd9="" in="SourceAlpha" type="matrix"
                                   values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                                   result="hardAlpha"></feColorMatrix>
                    <feOffset data-v-7b79ffd9="" dx="-2" dy="4"></feOffset>
                    <feGaussianBlur data-v-7b79ffd9="" stdDeviation="10"></feGaussianBlur>
                    <feComposite data-v-7b79ffd9="" in2="hardAlpha" operator="arithmetic" k2="-1" k3="1"></feComposite>
                    <feColorMatrix data-v-7b79ffd9="" type="matrix"
                                   values="0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0.28 0"></feColorMatrix>
                    <feBlend data-v-7b79ffd9="" mode="normal" in2="shape" result="effect1_innerShadow"></feBlend>
                  </filter>
                </defs>
              </svg>
              <div data-v-7b79ffd9="" class="text"><span data-v-7b79ffd9="">Реферал получит</span><strong
                  data-v-7b79ffd9="">+{{ nextLvlPercent() }}%</strong></div>
            </div>
          </div>
        </div>
        <div data-v-7b79ffd9="" class="levels">
          <div data-v-7b79ffd9="" class="title">Уровни</div>
          <div data-v-7b79ffd9="" class="separator"></div>
          <div data-v-7b79ffd9="" class="table">
            <div data-v-7b79ffd9="" class="table__head">
              <div data-v-7b79ffd9="">LVL</div>
              <div data-v-7b79ffd9="">Депозитов</div>
              <div data-v-7b79ffd9="">Ваш бонус</div>
              <div data-v-7b79ffd9="">Реферальный бонус</div>
            </div>
            <div data-v-7b79ffd9="" class="table__items">
              <div data-v-7b79ffd9="" class="item three">
                <div data-v-7b79ffd9="">
                  <div data-v-7b79ffd9="" class="lvl"> 5</div>
                </div>
                <div data-v-7b79ffd9="" class="deposits"> 30000₽</div>
                <div data-v-7b79ffd9="" class="bonus">25%</div>
                <div data-v-7b79ffd9="">+ 5% к депозиту</div>
              </div>
              <div data-v-7b79ffd9="" class="item two">
                <div data-v-7b79ffd9="">
                  <div data-v-7b79ffd9="" class="lvl"> 4</div>
                </div>
                <div data-v-7b79ffd9="" class="deposits"> 10000₽</div>
                <div data-v-7b79ffd9="" class="bonus">20%</div>
                <div data-v-7b79ffd9="">+ 5% к депозиту</div>
              </div>
              <div data-v-7b79ffd9="" class="item first">
                <div data-v-7b79ffd9="">
                  <div data-v-7b79ffd9="" class="lvl"> 3</div>
                </div>
                <div data-v-7b79ffd9="" class="deposits"> 1000₽</div>
                <div data-v-7b79ffd9="" class="bonus">15%</div>
                <div data-v-7b79ffd9="">+ 5% к депозиту</div>
              </div>
              <div data-v-7b79ffd9="" class="item">
                <div data-v-7b79ffd9="">
                  <div data-v-7b79ffd9="" class="lvl"> 2</div>
                </div>
                <div data-v-7b79ffd9="" class="deposits"> 500₽</div>
                <div data-v-7b79ffd9="" class="bonus">10%</div>
                <div data-v-7b79ffd9="">+ 5% к депозиту</div>
              </div>
              <div data-v-7b79ffd9="" class="item">
                <div data-v-7b79ffd9="">
                  <div data-v-7b79ffd9="" class="lvl"> 1</div>
                </div>
                <div data-v-7b79ffd9="" class="deposits"> 0₽</div>
                <div data-v-7b79ffd9="" class="bonus">5%</div>
                <div data-v-7b79ffd9="">+ 5% к депозиту</div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      domain: ''
    }
  },
  created() {
    this.$root.isLoading = true

    if (!this.$cookie.get('token')) {
      this.$root.isLoading = false
      return this.$router.back()
    }

    this.domain = window.location.protocol + '//' + window.location.hostname

    this.$root.isLoading = false
  },
  methods: {
    makeTextSelection() {
      const el = this.$refs['refLinkRef'];
      el.select();
      document.execCommand('copy');

      this.$root.showNotify('success', 'Реферальная ссылка скопирована в буфер обмена', 'success');
    },
    nextLvlMoney() {
      if (this.$root.user.referral_lvl === 1) {
        return 500
      } else if (this.$root.user.referral_lvl === 2) {
        return 1000
      } else if (this.$root.user.referral_lvl === 3) {
        return 10000
      } else if (this.$root.user.referral_lvl === 4) {
        return 30000
      } else if (this.$root.user.referral_lvl === 5) {
        return 30000
      }
    },
    nextLvlPercent() {
      if (this.$root.user.referral_lvl === 1) {
        return 5
      } else if (this.$root.user.referral_lvl === 2) {
        return 10
      } else if (this.$root.user.referral_lvl === 3) {
        return 15
      } else if (this.$root.user.referral_lvl === 4) {
        return 20
      } else if (this.$root.user.referral_lvl === 5) {
        return 25
      }
    },
    toBalance() {
      this.$root.request(
          'POST',
          '/graphql',
          {"query": "{referralBalanceToBalance {success}}"}
      ).then(() => {
        this.$root.getUser()
        this.$root.showNotify('Успешно', 'Обмен совершен', 'success')
      }).catch(e => {
        this.$root.showNotify('Ошибка', e[0].message, 'error')
      })
    },
    getWidth() {
      let width = (this.$root.user.referral_sum * 100) / this.nextLvlMoney()

      if (width < 0) {
        width = 0
      }

      return width
    },
  }
}
</script>